---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSettings.ShowBraceAbove
source: html/31199607-7a4e-3c68-a488-cc08fe99ae0b.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.ShowBraceAbove Property

Whether to show brace symbols above beams in plan views.

## Syntax (C#)
```csharp
public bool ShowBraceAbove { get; set; }
```